---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsTextOrientation
source: html/bf78e652-2c3e-eeb3-2db1-91c5c478fa0c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsTextOrientation Property

"Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsTextOrientation { get; }
```